dataset_gen/CE-CRP_openfoam/Design_Point_0/0/T
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   nonuniform List<scalar>
16384
(
0.005359147050191011
0.020578823540869602
0.02706803447973849
0.0003248724736521324
0.002476947546856534
0.0029826017068808664
0.001831234050975304
0.0024922306223975807
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}
