dataset_gen/CE-CRP_openfoam/Design_Point_0/0/p
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object p;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   nonuniform List<scalar>
16384
(
0.5426960831582485
0.9868869366005173
0.8154614284548342
0.07404465173409036
0.6232981268275579
0.32518332202674705
0.4722149251619493
0.5612771975694962
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}
