dataset_gen/CE-CRP_openfoam/Design_Point_0/0/rho
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object rho;
}

dimensions      [1 -3 0 0 0 0 0];
internalField   nonuniform List<scalar>
16384
(
0.3528410587186427
0.16709557931179375
0.10496990541124217
0.7941433120173511
0.8767930832880342
0.379884089544096
0.8984914683186939
0.7847065437552077
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}
